In [20]:
#pandas
import pandas as pd
df=pd.DataFrame([[1,2,3],[4,5,6]])

df.columns=["a","b","c"]
print(df)
df.a
df["a"]*2 #multiply huncha
df["a"]+df["b"]+2
df["a"]+df["b"]+df["c"]
df["c"]==3
type(df)

   a  b  c
0  1  2  3
1  4  5  6

pandas.core.frame.DataFrame

In [19]:
df[df["c"]==6]

   a  b  c
1  4  5  6

In [24]:
df[df["a"]==1] & df[df["c"]==3] #and kina use garna mildena ?

   a  b  c
0  1  2  3

In [25]:
df.rename(index={0:"x",1:"y"},inplace=True)

In [26]:
df

   a  b  c
a  1  2  3
b  4  5  6

In [35]:
import csv
df=pd.read_csv("mahima.csv")
df.head()
df.sample()
df.info()
df[df.name=="mahima"]
df[df.name.str.contains("mah")]
#mean median mode nikalna
df["id"].value_counts()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      7 non-null      int64
 1   name    7 non-null      object
 2   age     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 296.0+ bytes

1    1
2    1
3    1
4    1
5    1
6    1
7    1
Name: id, dtype: int64

In [37]:
grp=df.groupby("age")
for t, grp_df in grp:
    print(t,grp_df)

12    id      name  age
0   1    mahima   12
2   3  ranabhat   12
3   4      hero   12
5   6    nadika   12
20    id     name  age
1   2  nirajan   20
4   5    amrit   20
6   7  nishant   20

In [51]:
#python3 -m http.server
import csv
df=pd.read_csv("train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [75]:

#df.name ma space bhayepar kam bhayena 
# df[["Name","Age"]]

n_df=df[(df["Survived"]==1) &  (df["Sex"]=="male")]
a_df=df[df["Sex"]=="male"]
prob=n_df["Survived"].count()/a_df["Sex"].count()
prob

0.18890814558058924

In [77]:
a_df.mean()

C:\Users\Windows\AppData\Local\Temp\ipykernel_12432\4180362137.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  a_df.mean()

PassengerId    454.147314
Survived         0.188908
Pclass           2.389948
Age             30.726645
SibSp            0.429809
Parch            0.235702
Fare            25.523893
dtype: float64

In [82]:
a_df=df[(df["Sex"]=="male")& (df["Age"]>18)]
a_df.count()

PassengerId    382
Survived       382
Pclass         382
Name           382
Sex            382
Age            382
SibSp          382
Parch          382
Ticket         382
Fare           382
Cabin           86
Embarked       382
dtype: int64